using System;

namespace Lesson7_practice
{
    class Program
    {
        //1 Написать любое приложение, произвести его сборку с помощью MSBuild, 
        //осуществить декомпиляцию с помощью dotPeek, внести правки в программный код и пересобрать приложение.
        //static void Main(string[] args)
        //{
        //    Console.WriteLine("Чтобы сложить два числа, введите их по очереди");
        //    int a = Convert.ToInt32(Console.ReadLine());
        //    int b = Convert.ToInt32(Console.ReadLine());
        //    int result = a + b;
        //    Console.WriteLine("Сумма чисел: " + result);

        //    // вот что получилось после экспорта в dotpeek.... в общем попробовал - более\менее понятна суть
        //    Console.WriteLine("Чтобы сложить два числа, введите их по очереди");
        //    Console.WriteLine("Сумма чисел: " + (Convert.ToInt32(Console.ReadLine()) + Convert.ToInt32(Console.ReadLine())).ToString());
        //}

    }
}
